# Обозначим через ДЕЛ(n, m) утверждение 
# «натуральное число n делится без остатка на натуральное число m».

# Для какого наибольшего натурального числа А формула

# ДЕЛ(90, A) ∧ (¬ДЕЛ(x, А) → (ДЕЛ(x, 15) → ¬ДЕЛ(x, 20)))

# тождественно истинна 
# (то есть принимает значение 1 при любом натуральном значении переменной x)?
        
for a in range(100,0,-1):
    f = 1
    for x in range(1,1000):
        res = 90%a==0 and (x%a!=0) <= ((x%15==0) <= (x%20!=0))
        if res == 0:
            f = 0
            break
    if f == 1 :
        print(a)
        break

print('---------------')
 
for a in range(100, 0, -1): 
    k = 0
    for x in range(1, 1000):
        if (90 % a == 0) and ((x % a != 0) <= ((x % 15 == 0) <= (x % 20 != 0))):
            k += 1
    if k == 999:
        print(a)
        break
print('--------------------')

for a in range (1000, 0, -1):
    f = 1
    for x in range(1, 1000):
        if not(90 % a == 0 and (x % a != 0) <= ((x % 15 == 0) <= (x % 20 != 0))):
            f = 0
            break
    if f == 1:
        print(a)
        break

